swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_snand.c
/**************************************************************************//**
 * @file     rtl8735b_snand.c
 * @brief    Implement serial nand flash controller ROM code functions.
 * @version  1.10
 * @date     2021-06-28
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2020 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/
#include "cmsis.h"
#include <arm_cmse.h>
#include "rtl8735b_snand.h"

#if CONFIG_SNAND_FLASH_EN
#define SECTION_SNAND_TEXT           SECTION(".rom.hal_snand.text")
#define SECTION_SNAND_DATA           SECTION(".rom.hal_snand.data")
#define SECTION_SNAND_RODATA         SECTION(".rom.hal_snand.rodata")
#define SECTION_SNAND_BSS            SECTION(".rom.hal_snand.bss")
#define SECTION_SNAND_STUBS          SECTION(".rom.hal_snand.stubs")
/**

        \addtogroup hal_snand Serial NAND Flash Controller (SNAFC)
)
        @{
*/


/// @cond DOXYGEN_ROM_HAL_API

/**

        \addtogroup hal_rtl_snand_func Serial NAND Flash Controller HAL ROM APIs
        \ingroup hal_snand
        \brief Configure SPIC functions to control flash controller and communicate with a flash device.
               The user application(in RAM space) should not call these APIs directly.
               There is another set of Serial NAND Flash Controller HAL APIs in the RAM space is provided for the user application.
        @{
*/

/**
  \brief The stubs functions table to exports Serial NAND Flash Controller HAL functions in ROM.
*/
SECTION_SNAND_STUBS
const hal_snand_func_stubs_t hal_snand_stubs = {
	.hal_snand_init                 = hal_rtl_snand_init,
	.hal_snand_deinit               = hal_rtl_snand_deinit,
	.hal_snand_reset_to_spi         = hal_rtl_snand_issusResetOpCmd,
	.hal_snand_read_id              = hal_rtl_snand_issueReadIdOpCmd,
	.hal_snand_set_quad_enable      = hal_rtl_snand_quadModeEnable,
	.hal_snand_unset_quad_enable    = hal_rtl_snand_quadModeDisable,
	.hal_snand_set_feature          = hal_rtl_snand_issueSetFeatureRegisterOpCmd,
	.hal_snand_set_feature_no_check = hal_rtl_snand_issueSetFeatureRegisterOpCmd_NoCheck,
	.hal_snand_get_feature          = hal_rtl_snand_issueGetFeatureRegisterOpCmd,
	.hal_snand_wait_ready           = hal_rtl_snand_waitSnandOipComplete,
	.hal_snand_set_write_enable     = hal_rtl_snand_issueWriteEnableOpCmd,
	.hal_snand_set_write_disable    = hal_rtl_snand_issueWriteDisableOpCmd,
	.hal_snand_block_erase          = hal_rtl_snand_issueBlockEraseOpCmd,
	.hal_snand_page_program         = hal_rtl_snand_issueProgramExecuteOpCmd,
	.hal_snand_pageWrite            = hal_rtl_snand_pageWrite,
	.hal_snand_pageRead             = hal_rtl_snand_pageRead,
};

#define SNAFC_XCMR_LEN(val) ((val-1))
#define SNAFC_IO_WIDTH_LEN(io_width, w_len) (unsigned int)((io_width<<28)|w_len)

typedef uint32_t hal_rtl_snafc_bus_op_func(uint32_t, uint32_t, uint32_t, uint32_t, uint32_t, void *wr_buf);
hal_rtl_snafc_bus_op_func _hal_rtl_snafc_txCmdRaw, _hal_rtl_snafc_TxCmdAndWriteBuffer, _hal_rtl_snafc_TxCmdAndReadBuffer;
uint32_t _hal_rtl_snafc_tx_cmd(uint32_t opcode, hal_rtl_snafc_bus_op_func pSnandFunc, uint32_t data, uint32_t w_io_len, uint32_t r_io_len,
							   uint32_t byteLens,
							   void *wr_buf);
#define SNAFC_DONT_CARE (0xFFFFFFFF)

SECTION_SNAND_DATA
snand_bus_cfg_t mDefaultSnandCmdInfo = {
	.w_cmd_cycle = DEFAULT_W_CMD_CYCLE,
	.w_cmd = DEFAULT_W_CMD_OP,
	.w_addr_io = DEFAULT_W_CMD_IOWIDTH,
	.w_data_io = DEFAULT_W_DAT_IOWIDTH,
	.r_cmd = DEFAULT_R_CMD_OP,
	.r_cmd_cycle = DEFAULT_R_CMD_CYCLE,
	.r_addr_io = DEFAULT_R_CMD_IOWIDTH,
	.r_data_io = DEFAULT_R_DAT_IOWIDTH,
};

#if defined(CONFIG_ASIC)
#define MAX_SNAFC_CTRLR_RDY_CNT 0x4000
#define MAX_SNAFC_DMA_RDY_CNT 0x10000
#else /* !defined(CONFIG_ASIC) */
#define MAX_SNAFC_CTRLR_RDY_CNT 0x200
#define MAX_SNAFC_DMA_RDY_CNT 0x800
#endif /* !defined(CONFIG_ASIC) */

SECTION_SNAND_DATA static uint32_t mMaxSnafcCtrlRdyCnt;  /* = MAX_SNAFC_CTRLR_RDY_CNT */
SECTION_SNAND_DATA static uint32_t mMaxSnafcDmaRdyCnt; /* = MAX_SNAFC_DMA_RDY_CNT */

/**
 Control SNAFC's chip select signal
 */
#if 0
SECTION_SNAND_TEXT
static void
_hal_rtl_snand_DumpCmdInfo(
	snand_bus_cfg_t *pSnandCmdInfo
)
{
	if (!pSnandCmdInfo) {
		return;
	}
	switch (pSnandCmdInfo->w_data_io) {
	case SNAFC_SIO_WIDTH:
		dbg_printf("cmdW(1-1-1).");
		break;
	case SNAFC_DIO_WIDTH:
		dbg_printf("cmdW(1-1-2).");
		break;
	case SNAFC_QIO_WIDTH:
		dbg_printf("cmdW(1-1-4).");
		break;
	default:
		dbg_printf("ERR.cmdW(%d).", pSnandCmdInfo->w_data_io);
	}

	switch (pSnandCmdInfo->r_data_io) {
	case SNAFC_SIO_WIDTH:
		dbg_printf("cmdR(1-1-1).");
		break;
	case SNAFC_DIO_WIDTH:
		dbg_printf("cmdR(1-1-2).");
		break;
	case SNAFC_QIO_WIDTH:
		dbg_printf("cmdR(1-1-4).");
		break;
	default:
		dbg_printf("ERR.cmdR(%d).", pSnandCmdInfo->r_data_io);
	}
	dbg_printf("\r\n");
#if (defined(CONFIG_BUILD_ALL) && (CONFIG_BUILD_ALL == 1)) || (defined(CONFIG_BUILD_ROM) && (CONFIG_BUILD_ROM == 1))
	dump_for_one_bytes(pSnandCmdInfo, sizeof(snand_bus_cfg_t));   /* PhilipDebug */
#else
	dump_bytes(pSnandCmdInfo, sizeof(snand_bus_cfg_t));
#endif
	dbg_printf("\r\n");

	return;
} /* _hal_rtl_snand_DumpCmdInfo */
#endif

/**
 Check if the SPI NAND flash controller (SNAFC) completes it operation.
 */
SECTION_SNAND_TEXT
static uint32_t
_polling_snafc_ctrlr_ready(uint32_t timeout)
{
	SNAFC_TypeDef *snafcDev = SNAFC_S;
	uint32_t dmyCntr = 0;
	do {
		dmyCntr++;
	} while ((snafcDev->SNAFC_SR & SNAFC_BIT_NFCOS) && (dmyCntr < timeout));
	if (dmyCntr >= timeout) {
		return FAIL;
	} else {
		return SUCCESS;
	}
}

/**
 Check if the SPI NAND flash controller (SNAFC) DMA completes or not.
 */
SECTION_SNAND_TEXT
static uint32_t
_polling_snafc_dma_ready(uint32_t timeout)
{
	SNAFC_TypeDef *snafcDev = SNAFC_S;
	uint32_t dmyCntr = 0;
	do {
		dmyCntr++;
	} while ((0 != (snafcDev->SNAFC_SR & (SNAFC_BIT_NFDRS | SNAFC_BIT_NFDWS)))  && (dmyCntr < timeout));
	if (dmyCntr >= timeout) {
		return FAIL;
	} else {
		return SUCCESS;
	}
}

/**
 Control SNAFC's chip select signal
 */
SECTION_SNAND_TEXT
static void
_hal_rtl_snafc_chipSelect(
	uint32_t en
)
{
	SNAFC_TypeDef *snafc_s = SNAFC_S;
	if (en == ENABLE) {
		snafc_s->SNAFC_CCR = 0x0; /* Set #CS Low (active) */
	} else {
		snafc_s->SNAFC_CCR = 0x1; /* Set #CS high (inactive) */
	}
} /* _hal_rtl_snafc_chipSelect */


/**
 Set SNAFC's #CS as LOW (active)
 */
SECTION_SNAND_TEXT
static void
_hal_rtl_snafc_csLow(
	void
)
{
	_hal_rtl_snafc_chipSelect(ENABLE);
} /* _hal_rtl_snafc_csLow */


/**
 Set SNAFC's #CS as HIGH (inactive)
 */
SECTION_SNAND_TEXT
static void
_hal_rtl_snafc_csHigh(
	void
)
{
	_hal_rtl_snafc_chipSelect(DISABLE);
} /* _hal_rtl_snafc_csHigh */


/**
 PIO Read After-Write (RAW) command
 This command can help to read back the SPI NAND flash register value through PIO operation.
 */
SECTION_SNAND_TEXT
uint32_t
_hal_rtl_snafc_txCmdRaw(
	uint32_t opcode,
	uint32_t data,
	uint32_t w_io_len,
	uint32_t r_io_len,
	uint32_t byteLens,
	void *wr_buf
)
{
	SNAFC_TypeDef *snafc_s = SNAFC_S;
	uint32_t rdval = 0;
	uint32_t w_data = opcode;

	if (data != SNAFC_DONT_CARE) {
		uint32_t temp = (w_io_len & 0x3);
		if (0 != temp) {
			w_data = opcode | (data << ((3 - temp) * 8));
		}
	}

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

	if (r_io_len != SNAFC_DONT_CARE) {
		snafc_s->SNAFC_RCMR = r_io_len; //Trigger PIO read /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		rdval = snafc_s->SNAFC_RDR; //Getting r_len-BYTE data @REG32(SNFRDR)
	}
	return rdval;
} /* _hal_rtl_snafc_txCmdRaw */


/**
 PIO Write command (cmd with buffer write)
 This function can help to send a command to SPI NAND flash through PIO operation.
 */
SECTION_SNAND_TEXT
uint32_t
_hal_rtl_snafc_TxCmdAndWriteBuffer(
	uint32_t opcode,
	uint32_t col_addr,
	uint32_t addr_io,
	uint32_t data_io,
	uint32_t byteLens,
	void *wr_buf
)
{
	SNAFC_TypeDef *snafc_s = SNAFC_S;
	uint8_t tmp[4];
	uint32_t w_data;
	uint32_t w_io_len;
	uint8_t *pTmp = (uint8_t *) wr_buf;

	/* Command: SIO, 1-Byte */
	w_data = opcode;
	w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write

	/* Address: addr_io_len, 2-Byte */
	w_data = col_addr << 16;
	w_io_len = SNAFC_IO_WIDTH_LEN(addr_io, SNAFC_XCMR_LEN(2));
	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write

	/* Data: data_io_len, wr_len-Byte */
	w_io_len = SNAFC_IO_WIDTH_LEN(data_io, SNAFC_XCMR_LEN(1));
	while (byteLens > 0) {
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		if (byteLens < 4) {
			snafc_s->SNAFC_WCMR = (w_io_len | SNAFC_XCMR_LEN(byteLens)); /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
			byteLens = 0;
		} else {
			snafc_s->SNAFC_WCMR = (w_io_len | SNAFC_XCMR_LEN(4)); /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
			byteLens -= 4;
		}
		/* The last few bytes may be garbage but won't be written to flash, since its length is explicitly given */
		tmp[0] = *((uint8_t *)pTmp++);
		tmp[1] = *((uint8_t *)pTmp++);
		tmp[2] = *((uint8_t *)pTmp++);
		tmp[3] = *((uint8_t *)pTmp++);
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		snafc_s->SNAFC_WDR = *((unsigned int *)tmp); //Trigger PIO Write
	}
	return SUCCESS;
} /* _hal_rtl_snafc_TxCmdAndWriteBuffer */


/**
 PIO Read command (cmd with buffer read)
 This function can help to read back the SPI NAND flash register value through PIO operation.
 */
SECTION_SNAND_TEXT
uint32_t
_hal_rtl_snafc_TxCmdAndReadBuffer(
	uint32_t opcode,
	uint32_t col_addr,
	uint32_t addr_io,
	uint32_t data_io,
	uint32_t byteLens,
	void *wr_buf
)
{
	SNAFC_TypeDef *snafc_s = SNAFC_S;
	uint32_t w_data;
	uint32_t w_io_len;
	uint32_t r_io_len;
	uint32_t wr_bound;
	uint32_t i;
	uint32_t dummy = 0x00;
	uint8_t tmp[4];
	uint8_t *pTmp = NULL;

	/* Command: SIO, 1-Byte */
	w_data = opcode;
	w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write

	/* Address: addr_io_len, 4-Byte */
#ifdef NAND_SPI_USE_QIO
	/*(Step4) Send 4-Byte Address for QIO , Fast read op(0xeb)need 4T's addr + 4T's dummy*/
	w_data = (col_addr << 24) | (dummy << 16);
	w_io_len = SNAFC_IO_WIDTH_LEN(addr_io, SNAFC_XCMR_LEN(4));

#else  /*(Step4) Send 3-Byte Address for SIO/DIO */
	w_data = (col_addr << 16) | (dummy << 8);
	w_io_len = SNAFC_IO_WIDTH_LEN(addr_io, SNAFC_XCMR_LEN(3));
#endif

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

	/* Data: data_io_len, wr_len-Byte */
	r_io_len = SNAFC_IO_WIDTH_LEN(data_io, SNAFC_XCMR_LEN(1));
	wr_bound = (uint32_t)wr_buf + byteLens;

