swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_snand.c
	if (wr_buf) {
		pTmp = (uint8_t *) wr_buf;
	}

	if (byteLens >= 4) {
		while ((unsigned int)pTmp < (wr_bound & 0xFFFFFFFC)) {
			snafc_s->SNAFC_RCMR = (r_io_len | SNAFC_XCMR_LEN(4)); /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
			_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
			*((uint32_t *)tmp) = snafc_s->SNAFC_RDR;
			*((uint8_t *)pTmp++) = tmp[0];
			*((uint8_t *)pTmp++) = tmp[1];
			*((uint8_t *)pTmp++) = tmp[2];
			*((uint8_t *)pTmp++) = tmp[3];
		}
	}
	for (i = 0; i < (byteLens & 0x3); i++) {
		snafc_s->SNAFC_RCMR = (r_io_len); /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		*((uint8_t *)pTmp++) = (snafc_s->SNAFC_RDR >> 24);
	}
	return SUCCESS;
} /* _hal_rtl_snafc_TxCmdAndReadBuffer */


/**
 PIO command wrapper for write/read-after-write/read behavior.
*/
SECTION_SNAND_TEXT
uint32_t
_hal_rtl_snafc_tx_cmd(
	uint32_t opcode,
	hal_rtl_snafc_bus_op_func pSnandFunc,
	uint32_t data,
	uint32_t w_io_len,
	uint32_t r_io_len,
	uint32_t byteLens,
	void *pBuf
)
{
	uint32_t ret = 0x0;

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	_hal_rtl_snafc_csHigh(); /* deactivate CS */

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	_hal_rtl_snafc_csLow();  /* activate CS */

	ret = pSnandFunc((opcode << 24), data, w_io_len, r_io_len, byteLens,
					 pBuf); /* _hal_rtl_snafc_txCmdRaw, _hal_rtl_snafc_TxCmdAndWriteBuffer, _hal_rtl_snafc_TxCmdAndReadBuffer */

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
	_hal_rtl_snafc_csHigh(); /* deactivate CS */

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

	return ret;
} /* _hal_rtl_snafc_tx_cmd */


/**
 Enabling SNAFC, and its LX bus, and switch pinmux to Serial NAND FLASH (SNAFC)
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_init(
	void *pAdaptor
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	SNAFC_TypeDef *snafc_s = SNAFC_S;
	SYSON_S_TypeDef *syson_s = SYSON_S;
	uint32_t val;
	uint32_t tClkSel = 0;
	uint32_t tClkSrcSel = 0, tBakClkSrcSel = 0;

	mMaxSnafcCtrlRdyCnt = MAX_SNAFC_CTRLR_RDY_CNT;
	mMaxSnafcDmaRdyCnt = MAX_SNAFC_DMA_RDY_CNT;

	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
		tClkSel = pSnafcAdaptor->clkSel;

		if (tClkSel >= SNAFC_INITVAL_SETS) {
			tClkSel = SNAFC_SPEED_SEL_0;
		}

		/*
		SYSON_S_REG_SYS_FLASH_CTRL
		    [6], R/W, 0, BIT_NAND_FLASH_CLK_EN, 1: Enable NAND FLASH CLK
		    [5], R/W, 0, BIT_NAND_FLASH_EN,     1: Enable NAND FLASH
		    [4], R, 0, BIT_HS_FLASH_INIT_OK,    BOOT_finish
		    [2], R/W, 0, BIT_SYS_FLASH_SRC_SEL, 0: 250MHz, 1:200MHz
		    [1], R/W, 0, BIT_NOR_FLASH_CLK_EN,  1: Enable NOR FLASH CLK
		    [0], R/W, 0, BIT_NOR_FLASH_EN,      1: Enable NOR FLASH
		*/
		if (tClkSel & 0x1) {
			tClkSrcSel = 0;
		} else {
			tClkSrcSel = 1;
		}
		if (pSnafcAdaptor->maxCtrlRdyCnt) {
			mMaxSnafcCtrlRdyCnt = pSnafcAdaptor->maxCtrlRdyCnt;
		}
		if (pSnafcAdaptor->maxDmaRdyCnt) {
			mMaxSnafcDmaRdyCnt = pSnafcAdaptor->maxDmaRdyCnt;
		}
	} else {
		tClkSrcSel = 0;
	}

	/* 0x6 to 0x5000088C [7:4] for Enabling NAND flash */
	val = syson_s->SYSON_S_REG_SYS_FLASH_CTRL;
	tBakClkSrcSel = (val & SYSON_S_BIT_SYS_FLASH_SRC_SEL); /* keep [2] BIT_SYS_FLASH_SRC_SEL */
	val |= (SYSON_S_BIT_NAND_FLASH_CLK_EN | SYSON_S_BIT_NAND_FLASH_EN | ((tClkSrcSel == 1) ? SYSON_S_BIT_SYS_FLASH_SRC_SEL : 0));
	syson_s->SYSON_S_REG_SYS_FLASH_CTRL = val;

	/* 0x3 to 0x5000089C [17:16] for Enabling LX bus */
	val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
	val |= (SYSON_S_BIT_LXBUS_CLK_EN | SYSON_S_BIT_LXBUS_EN);
	syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;

	/* 0x1 to 0x50000890 [7] for Selecting NAND flash */
	val = syson_s->SYSON_S_REG_SYS_FLASH_PHY_CTRL0;
	val |= SYSON_S_BIT_FLASH_PHY_MUX_SEL;
	syson_s->SYSON_S_REG_SYS_FLASH_PHY_CTRL0 = val;

	if (pAdaptor) {
		snafc_s->SNAFC_CFR = pSnafcAdaptor->initVal[tClkSel].l;
		pSnafcAdaptor->bakClkSrcSel = (uint8_t) tBakClkSrcSel;
	} else {
		val = snafc_s->SNAFC_CFR;
		DBG_SNAND_INFO("[0x%08x] = 0x%08x. (snafc_s->SNAFC_CFR)++\r\n", (void *) & (snafc_s->SNAFC_CFR), val);
		/**
		    [31:31] 0: disable dummy read after DMA write transaction
		    [28:28] 0: Not boot from spi nand flash
		    [26:24] DEBUG_SELECT
		    [22:22] NAND Flash Read Byte Ordering.
		    [21:21] NAND Flash Write Byte Ordering.
		    [20:20] NAND flash controller DMA interrupt enable.
		    [14:14] 0: Slave data is the same order with LX slave bus
		    [13:13] 0: DMA data is the same order with LX master bus
		    [12:12] 1: LX bus DMA precise. 0: LX bus DMA imprecise.
		    [9:8] set the data latch pipe latency = 0; (Power-on default is 2b'00 (data latch pipe latency=0))
		    [6:4] set the SPI operating clock rate = DIV2; (Power-on default is 3b'111 (div16))
		    [1:0] set LBC burst size to 2b'11 (128 bytes); (Power-on default is 2b'11 (128 bytes))
		        2b'00 (16 bytes)
		        2b'01 (32 bytes)
		        2b'10 (64 bytes)
		        2b'11 (128 bytes)(Power-on default)
		*/
		val &= ~(SNAFC_BIT_DMA_ENDIAN);
		//val &= ~(SNAFC_BIT_PRECISE);
		val &= ~(SNAFC_MASK_PIPE_LAT);
		val &= ~(SNAFC_MASK_SPI_CLK_DIV);
		val &= ~(SNAFC_MASK_LBC_BSZ);
		val |= (3 << SNAFC_SHIFT_LBC_BSZ);

#if 1 /* input clk for SNAFC 200MHz, readid shift 1-bit when spi_clk=100MHz*/
#if defined(CONFIG_ASIC)
#define DEFAULT_SPI_CLK_DIV     (0)
#define DEFAULT_PIPE_LAT        (1)
#else /* !defined(CONFIG_ASIC) */
#define DEFAULT_SPI_CLK_DIV     (0)
#define DEFAULT_PIPE_LAT        (0)
#endif /* !defined(CONFIG_ASIC) */

		val |= ((DEFAULT_SPI_CLK_DIV << SNAFC_SHIFT_SPI_CLK_DIV) & SNAFC_MASK_SPI_CLK_DIV);
		val |= ((DEFAULT_PIPE_LAT << SNAFC_SHIFT_PIPE_LAT) & SNAFC_MASK_PIPE_LAT);
#endif /* input clk for SNAFC 200MHz, readid shift 1-bit when spi_clk=100MHz*/

		snafc_s->SNAFC_CFR = val;
		DBG_SNAND_INFO("[0x%08x] = 0x%08x. (snafc_s->SNAFC_CFR=0x%08x)--\r\n", (void *) & (snafc_s->SNAFC_CFR), val, snafc_s->SNAFC_CFR);
	}
	return;
} /* hal_rtl_snand_init */


/**
 Disabling SNAFC, and its LX bus, and switch pinmux to SPI NOR FLASH (SPIC)
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_deinit(
	void *pAdaptor
)
{
	SYSON_S_TypeDef *syson_s = SYSON_S;
	uint32_t val;
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	uint32_t tBakClkSrcSel = 0;

	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
		tBakClkSrcSel = (uint32_t) pSnafcAdaptor->bakClkSrcSel;
	} else {
		tBakClkSrcSel = 0;
	}

	/* 0x0 to 0x50000890 [7] for Selecting SPI NOR flash */
	val = syson_s->SYSON_S_REG_SYS_FLASH_PHY_CTRL0;
	val &= ~SYSON_S_BIT_FLASH_PHY_MUX_SEL;
	syson_s->SYSON_S_REG_SYS_FLASH_PHY_CTRL0 = val;

	/* 0x0 to 0x5000089C [17:16] for Enabling LX bus */
	val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
	val &= ~(SYSON_S_BIT_LXBUS_CLK_EN | SYSON_S_BIT_LXBUS_EN);
	syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;

