swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_snand.c
	/* 0x6 to 0x5000088C [7:4] for Enabling NAND flash */
	val = syson_s->SYSON_S_REG_SYS_FLASH_CTRL;
	val &= ~(SYSON_S_BIT_NAND_FLASH_CLK_EN | SYSON_S_BIT_NAND_FLASH_EN | SYSON_S_BIT_SYS_FLASH_SRC_SEL);
	val |= tBakClkSrcSel;
	syson_s->SYSON_S_REG_SYS_FLASH_CTRL = val;

	return;
} /* hal_rtl_snand_deinit */


/**
 Send RESET_OP command to bus interface
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_issusResetOpCmd(
	void *pAdaptor
)
{
	unsigned int w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	uint32_t ret = _hal_rtl_snafc_tx_cmd(SNAND_RESET_OP, _hal_rtl_snafc_txCmdRaw, SNAFC_DONT_CARE, w_io_len, SNAFC_DONT_CARE, 0, 0);
	return ((ret >> 8) & 0xFFFFFF);
} /* hal_rtl_snand_issusResetOpCmd */


/**
 Send READ_ID_OP command to bus interface, and return flash vendor information code
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_issueReadIdOpCmd(
	void *pAdaptor
)
{
	// write length = 2byte
	uint32_t w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(2));
	// read length = 3byte
	uint32_t r_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(3));

	uint32_t ret = _hal_rtl_snafc_tx_cmd(SNAND_RDID_OP, _hal_rtl_snafc_txCmdRaw, SNAFC_DONT_CARE, w_io_len, r_io_len, 0, 0);
	DBG_SNAND_INFO("\r\nspi_nand_id =0x%x\r\n", ((ret >> 8) & 0xFFFFFF));
	return ((ret >> 8) & 0xFFFFFF);
} /* hal_rtl_snand_issueReadIdOpCmd */


/**
 Send DATA IO for QUAD IO (QIO)
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_quadModeEnable(
	void *pAdaptor
)
{
	/* FIXME ToDo */
} /* hal_rtl_snand_quadModeEnable */


/**
 Send DATA IO for SINGLE IO (SIO)
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_quadModeDisable(
	void *pAdaptor
)
{
	/* FIXME ToDo */
} /* hal_rtl_snand_quadModeDisable */


/**
 Send SET_FEATURE_OP command and data to bus interface.
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_issueSetFeatureRegisterOpCmd(
	void *pAdaptor,
	uint32_t feature_addr,
	uint32_t value
)
{
	/* Set configuration (block protect, OTP feature) register. */
	unsigned int w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(3));
	_hal_rtl_snafc_tx_cmd(SNAND_SET_FEATURE_OP, _hal_rtl_snafc_txCmdRaw, ((feature_addr << 8) | value), w_io_len, SNAFC_DONT_CARE, 0, 0);
	return;
} /* hal_rtl_snand_issueSetFeatureRegisterOpCmd */


/**
 Send SET_FEATURE_OP command and data to bus interface.
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_issueSetFeatureRegisterOpCmd_NoCheck(
	void *pAdaptor,
	uint32_t feature_addr,
	uint32_t value
)
{
	/* Set configuration (block protect, OTP feature) register. */
	unsigned int w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(3));
	_hal_rtl_snafc_tx_cmd(SNAND_SET_FEATURE_OP, _hal_rtl_snafc_txCmdRaw, ((feature_addr << 8) | value), w_io_len, SNAFC_DONT_CARE, 0, 0);
	return;
} /* hal_rtl_snand_issueSetFeatureRegisterOpCmd_NoCheck */


/**
 Send GET_FEATURE_OP command to bus interface, and return flash feature.
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_issueGetFeatureRegisterOpCmd(
	void *pAdaptor,
	uint32_t feature_addr
)
{
	/* Get configuration (block protect, OTP feature) register and status (op_in_progress, write_enable_latch, erase_fail, program_fail, ecc_sts) register. */
	unsigned int w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(2));
	unsigned int r_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	unsigned int ret = _hal_rtl_snafc_tx_cmd(SNAND_GET_FEATURE_OP, _hal_rtl_snafc_txCmdRaw, feature_addr, w_io_len, r_io_len, 0, 0);
	return ((ret >> 24) & 0xFF);
} /* hal_rtl_snand_issueGetFeatureRegisterOpCmd */


/**
 Wait SPI NAND flash ready (MX35LF1GE4AB-Z4I, MX35LF2GE4AB-MI)
 */
SECTION_SNAND_TEXT
static uint32_t
_snand_MXIC_waitSnandOipComplete(
	void *pAdaptor
)
{
	/*
	    MX35LF2GE4AB_MI Feature Register definition:
	    * reg[0xC0] = 0x20
	        [5:4] ECC_Sts=10 (00b=0 bit error / 01b= 1~4 bits error corrected / 10b=More than 4 bit error not corrected / 11b=Reserved)
	        [3]P_Fail=0 (Program Fail=0)
	        [2]E_Fail=0 (Erase Fail=0)
	        [1]WEL=0 (Write Enable Latch=0)
	        [0]OIP=0 (Op_In_progress=0)

	    <<<Warning>>>: Sometimes, bitmap different between each Flash chip part-number.
	*/
	unsigned int feature_addr = 0xC0;
	unsigned int oip = hal_rtl_snand_issueGetFeatureRegisterOpCmd(pAdaptor, feature_addr); /* [0] OIP = Op_In_Progress */
	unsigned int swTo = 0;

#if defined(CONFIG_ASIC)
#define MAX_SNAND_OIP_MSK_CNT 0x800
#define MAX_SNAND_OIP_TIMEOUT_CNT 0x4000
#else /* !defined(CONFIG_ASIC) */
#define MAX_SNAND_OIP_MSK_CNT 0x200
#define MAX_SNAND_OIP_TIMEOUT_CNT 0x1000
#endif /* !defined(CONFIG_ASIC) */

	while ((oip & 0x1) != 0) {
		oip = hal_rtl_snand_issueGetFeatureRegisterOpCmd(pAdaptor, feature_addr);
		swTo++;
		if ((swTo & MAX_SNAND_OIP_MSK_CNT) == MAX_SNAND_OIP_MSK_CNT) {
			DBG_SNAND_ERR("%s Ln %u. oip=0x%0x\r\n", __FILE__, __LINE__, oip);
		}
		if (swTo > MAX_SNAND_OIP_TIMEOUT_CNT) {
			break;
		}
	}
	if (swTo > MAX_SNAND_OIP_TIMEOUT_CNT) {
		DBG_SNAND_ERR("%s Ln %u. swTo. oip=0x%0x\r\n", __FILE__, __LINE__, oip);
		return FAIL;
	}
	return SUCCESS;

} /* _snand_MXIC_waitSnandOipComplete */


/**
 Wait SPI NAND flash ready
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_waitSnandOipComplete(
	void *pAdaptor
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
		if (pSnafcAdaptor->funcWaitSnandReady) {
			return pSnafcAdaptor->funcWaitSnandReady(pSnafcAdaptor->maxWaitOipCnt);
		}
	}
	return _snand_MXIC_waitSnandOipComplete(pAdaptor);
} /* hal_rtl_snand_waitSnandOipComplet */


/**
 Check WEL (Write-Enable-Latched) Status
 */
SECTION_SNAND_TEXT
static uint32_t
_snand_MXIC_chkWelStsAfterWriteEnableOp(
	void *pAdaptor
)
{
	/*
	    MX35LF2GE4AB_MI Feature Register definition:
	    * reg[0xC0]
	        [5:4] ECC_Sts=10 (00b=0 bit error / 01b= 1~4 bits error corrected / 10b=More than 4 bit error not corrected / 11b=Reserved)
	        [3]P_Fail=0 (Program Fail=0)
	        [2]E_Fail=0 (Erase Fail=0)
	        [1]WEL=0 (Write Enable Latch=0)
	        [0]OIP=0 (Op_In_progress=0)

	    <<<Warning>>>: Sometimes, bitmap different between each Flash chip part-number.
	*/
	uint32_t feature_addr = 0xC0;
	uint32_t regValue = hal_rtl_snand_issueGetFeatureRegisterOpCmd(pAdaptor, feature_addr);
	uint32_t wel = ((regValue >> 1) & 0x1);
	return wel;
} /* _snand_MXIC_chkWelStsAfterWriteEnableOp */


/**
 Check Erase Status (Erase Fail, or SUCCESS)
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_chkWelStsAfterWriteEnableOp(
	void *pAdaptor
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
		if (pSnafcAdaptor->funcChkWelSts) {
			return pSnafcAdaptor->funcChkWelSts();
		}
	}
	return _snand_MXIC_chkWelStsAfterWriteEnableOp(pAdaptor);
} /* hal_rtl_snand_chkWelStsAfterWriteEnableOp */


/**
 Check Erase Status (Erase Fail, or SUCCESS) (MX35LF1GE4AB-Z4I, MX35LF2GE4AB-MI)
 */
SECTION_SNAND_TEXT
static uint32_t
_snand_MXIC_chkEraseStsAfterEraseOp(
	void *pAdaptor
)
{
	/*
	    MX35LF2GE4AB_MI Feature Register definition:
	    * reg[0xC0]
	        [5:4] ECC_Sts=10 (00b=0 bit error / 01b= 1~4 bits error corrected / 10b=More than 4 bit error not corrected / 11b=Reserved)
	        [3]P_Fail=0 (Program Fail=0)
	        [2]E_Fail=0 (Erase Fail=0)
	        [1]WEL=0 (Write Enable Latch=0)
	        [0]OIP=0 (Op_In_progress=0)

	    <<<Warning>>>: Sometimes, bitmap different between each Flash chip part-number.
	*/
	uint32_t feature_addr = 0xC0;
	uint32_t regValue = hal_rtl_snand_issueGetFeatureRegisterOpCmd(pAdaptor, feature_addr);
	uint32_t efail = ((regValue >> 2) & 0x1);

