swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_snand.c
	/*
	 * Check Program Status
	 */
	if (1 == efail) {
		DBG_SNAND_ERR("Program Fail\n");
		return FAIL;
	} else {
		return SUCCESS;
	}
} /* _snand_MXIC_chkEraseStsAfterEraseOp */


/**
 Check Erase Status (Erase Fail, or SUCCESS)
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_chkEraseStsAfterEraseOp(
	void *pAdaptor
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
		if (pSnafcAdaptor->funcChkEraseSts) {
			return pSnafcAdaptor->funcChkEraseSts();
		}
	}
	return _snand_MXIC_chkEraseStsAfterEraseOp(pAdaptor);
} /* hal_rtl_snand_chkEraseStsAfterEraseOp */


/**
 Check Program Status (Program Fail, or SUCCESS) (MX35LF1GE4AB-Z4I, MX35LF2GE4AB-MI)
 */
SECTION_SNAND_TEXT
static uint32_t
_snand_MXIC_chkPgmStsAfterWriteOp(
	void *pAdaptor
)
{
	/*
	    MX35LF2GE4AB_MI Feature Register definition:
	    * reg[0xC0]
	        [5:4] ECC_Sts=10 (00b=0 bit error / 01b= 1~4 bits error corrected / 10b=More than 4 bit error not corrected / 11b=Reserved)
	        [3]P_Fail=0 (Program Fail=0)
	        [2]E_Fail=0 (Erase Fail=0)
	        [1]WEL=0 (Write Enable Latch=0)
	        [0]OIP=0 (Op_In_progress=0)

	    <<<Warning>>>: Sometimes, bitmap different between each Flash chip part-number.
	*/
	uint32_t feature_addr = 0xC0;
	uint32_t regValue = hal_rtl_snand_issueGetFeatureRegisterOpCmd(pAdaptor, feature_addr);
	uint32_t pfail = ((regValue >> 3) & 0x1);

	/*
	 * Check Program Status
	 */
	if (1 == pfail) {
		DBG_SNAND_ERR("Program Fail\n");
		return FAIL;
	} else {
		return SUCCESS;
	}
} /* _snand_MXIC_chkPgmStsAfterWriteOp */


/**
 Check Program Status (Program Fail, or SUCCESS))
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_chkPgmStsAfterWriteOp(
	void *pAdaptor
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
		if (pSnafcAdaptor->funcChkPgmSts) {
			return pSnafcAdaptor->funcChkPgmSts();
		}
	}
	return _snand_MXIC_chkPgmStsAfterWriteOp(pAdaptor);
} /* hal_rtl_snand_chkPgmStsAfterWriteOp */


/**
 Check ECC Status (Success (No err) / bit err but FIXED / bit err NOT FIX) (MX35LF1GE4AB-Z4I, MX35LF2GE4AB-MI)
 */
SECTION_SNAND_TEXT
static uint32_t
_snand_MXIC_chkEccStsAfterReadOp(
	void *pAdaptor
)
{
	/*
	    MX35LF2GE4AB_MI Feature Register definition:
	    * reg[0xC0]
	        [5:4] ECC_Sts=10 (00b=0 bit error / 01b= 1~4 bits error corrected / 10b=More than 4 bit error not corrected / 11b=Reserved)
	        [3]P_Fail=0 (Program Fail=0)
	        [2]E_Fail=0 (Erase Fail=0)
	        [1]WEL=0 (Write Enable Latch=0)
	        [0]OIP=0 (Op_In_progress=0)

	    <<<Warning>>>: Sometimes, bitmap different between each Flash chip part-number.
	*/
	uint32_t feature_addr = 0xC0;
	uint32_t regValue = hal_rtl_snand_issueGetFeatureRegisterOpCmd(pAdaptor, feature_addr);
	uint32_t eccSts = ((regValue >> 4) & 0x3);

	/*
	 * Check ECC Status
	 */
	if (1 == eccSts) {
		DBG_SNAND_INFO("BIT Err, ALREADY FIX\r\n");
	} else if (2 == eccSts) {
		DBG_SNAND_ERR("ECC Err, CANNOT FIX\r\n");
	}
	return eccSts;
} /* _snand_MXIC_chkEccStsAfterReadOp */


/**
 Check ECC Status (Success (No err) / bit err but FIXED / bit err NOT FIX)
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_chkEccStsAfterReadOp(
	void *pAdaptor
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
		if (pSnafcAdaptor->funcChkEccSts) {
			return pSnafcAdaptor->funcChkEccSts();
		}
	}
	return _snand_MXIC_chkEccStsAfterReadOp(pAdaptor);

} /* hal_rtl_snand_chkEccStsAfterReadOp */


/**
 Send WRITE_ENABLE_OP command to bus interface
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_issueWriteEnableOpCmd(
	void *pAdaptor
)
{
	unsigned int w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	_hal_rtl_snafc_tx_cmd(SNAND_WRITE_ENABLE_OP, _hal_rtl_snafc_txCmdRaw, SNAFC_DONT_CARE, w_io_len, SNAFC_DONT_CARE, 0, 0);
} /* hal_rtl_snand_issueWriteEnableOpCmd */


/**
 Send WRITE_DISABLE_OP command to bus interface
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_issueWriteDisableOpCmd(
	void *pAdaptor
)
{
	unsigned int w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	_hal_rtl_snafc_tx_cmd(SNAND_WRITE_DISABLE_OP, _hal_rtl_snafc_txCmdRaw, SNAFC_DONT_CARE, w_io_len, SNAFC_DONT_CARE, 0, 0);
} /* hal_rtl_snand_issueWriteDisableOpCmd */


/**
 Erase block within SPI NAND flash
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_issueBlockEraseOpCmd(
	void *pAdaptor,
	uint32_t blkPageAddr
)
{
	uint32_t retVal;
	hal_rtl_snand_issueWriteEnableOpCmd(pAdaptor);
	/*
	 * 1-BYTE CMD + 1-BYTE Dummy + 2-BYTE Address
	 */
	uint32_t w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(4));
	_hal_rtl_snafc_tx_cmd(SNAND_BLOCK_ERASE_OP, _hal_rtl_snafc_txCmdRaw, blkPageAddr, w_io_len, SNAFC_DONT_CARE, 0, 0);

#if 1 /* FIXME ToDo: install callback */
	/*
	 * Wait S-NAND device complete
	 */
	retVal = hal_rtl_snand_waitSnandOipComplete(pAdaptor);
#endif /* FIXME ToDo: install callback */
#if 1 /* FIXME ToDo: install callback */
	/*
	 * Check Erase Status
	 */
	retVal |= hal_rtl_snand_chkEraseStsAfterEraseOp(pAdaptor);
#endif /* FIXME ToDo: install callback */
	return retVal;
} /* hal_rtl_snand_issueBlockEraseOpCmd */


/**
 Send PROGRAM_EXECUTE_OP command to bus interface, and polling flash status for ready.
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_issueProgramExecuteOpCmd(
	void *pAdaptor,
	uint32_t blkPageAddr
)
{
	uint32_t retVal = SUCCESS;
	/* 1-BYTE CMD + 1-BYTE Dummy + 2-BYTE Address */
	unsigned int w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(4));
	_hal_rtl_snafc_tx_cmd(SNAND_PROGRAM_EXECUTE_OP, _hal_rtl_snafc_txCmdRaw, blkPageAddr, w_io_len, SNAFC_DONT_CARE, 0, 0);

#if 1 /* FIXME ToDo: install callback */
	/*
	 * Wait S-NAND device complete
	 */
	retVal |= hal_rtl_snand_waitSnandOipComplete(pAdaptor);
#endif /* FIXME ToDo: install callback */
#if 1 /* FIXME ToDo: install callback */
	retVal |= hal_rtl_snand_chkPgmStsAfterWriteOp(pAdaptor);
#endif /* FIXME ToDo: install callback */
	return retVal;
} /* hal_rtl_snand_issueProgramExecuteOpCmd */


