swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_snand.c
/*
 * PIO Write one Chunk (2112-Byte)
 * Start from the assigned cache register address (CA=col_addr)
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_pioPageWrite(
	void *pAdaptor,
	void *memAddr,
	uint32_t byteLens,
	uint32_t blkPageAddr
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	uint32_t col_addr = 0;
	uint32_t retVal = SUCCESS;

	if (pAdaptor) {
		pSnafcAdaptor = (hal_snafc_adaptor_t *)pAdaptor;
	}
	hal_rtl_snand_issueWriteEnableOpCmd(pAdaptor);

	if (pAdaptor) {
		col_addr = pSnafcAdaptor->col_addr;
		if ((0 != pSnafcAdaptor->snand_cmd_info.w_cmd) && (mDefaultSnandCmdInfo.w_cmd != pSnafcAdaptor->snand_cmd_info.w_cmd)) {
			mDefaultSnandCmdInfo.w_cmd = pSnafcAdaptor->snand_cmd_info.w_cmd;
			mDefaultSnandCmdInfo.w_addr_io = pSnafcAdaptor->snand_cmd_info.w_addr_io;
			mDefaultSnandCmdInfo.w_data_io = pSnafcAdaptor->snand_cmd_info.w_data_io;
		}
	} else {
		col_addr = 0;
	}

	_hal_rtl_snafc_tx_cmd(mDefaultSnandCmdInfo.w_cmd, _hal_rtl_snafc_TxCmdAndWriteBuffer, col_addr, mDefaultSnandCmdInfo.w_addr_io, mDefaultSnandCmdInfo.w_data_io,
						  byteLens, memAddr);
	retVal = hal_rtl_snand_issueProgramExecuteOpCmd(pAdaptor, blkPageAddr);
	hal_rtl_snand_issueWriteDisableOpCmd(pAdaptor);
	return retVal;
} /* hal_rtl_snand_pioPageWrite */


/*
 * PIO Write Less than One Chunk (Less than 2112-Byte)
 * Start from the assigned cache register address (CA=col_addr)
 */
SECTION_SNAND_TEXT
void
hal_rtl_snand_issuePageDataReadToCacheBufOpCmd(
	uint32_t blkPageAddr
)
{
	/* 1-BYTE CMD + 1-BYTE Dummy + 2-BYTE Address */
	uint32_t w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(4));
	_hal_rtl_snafc_tx_cmd(SNAND_PAGE_DATA_READ_OP, _hal_rtl_snafc_txCmdRaw, blkPageAddr, w_io_len, SNAFC_DONT_CARE, 0, 0);

} /* hal_rtl_snand_issuePageDataReadToCacheBufOpCmd */


/*
 * PIO Read One Chunk (2112-Byte)
 * Start from the assigned cache register address (CA=col_addr)
 */
SECTION_SNAND_TEXT
void
hal_rtl_snafc_pioPageRead(
	void *pAdaptor,
	void *memAddr,
	uint32_t byteLens,
	uint32_t blkPageAddr
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	uint32_t col_addr = 0;

	if (pAdaptor) {
		pSnafcAdaptor = pAdaptor;
	}
	hal_rtl_snand_issuePageDataReadToCacheBufOpCmd(blkPageAddr);
	hal_rtl_snand_waitSnandOipComplete(pSnafcAdaptor);

	if (pAdaptor) {
		col_addr = pSnafcAdaptor->col_addr;
		if ((0 != pSnafcAdaptor->snand_cmd_info.r_cmd) && (mDefaultSnandCmdInfo.r_cmd != pSnafcAdaptor->snand_cmd_info.r_cmd)) {
			mDefaultSnandCmdInfo.r_cmd = pSnafcAdaptor->snand_cmd_info.r_cmd;
			mDefaultSnandCmdInfo.r_addr_io = pSnafcAdaptor->snand_cmd_info.r_addr_io;
			mDefaultSnandCmdInfo.r_data_io = pSnafcAdaptor->snand_cmd_info.r_data_io;
		}
	} else {
		col_addr = 0;
	}

	_hal_rtl_snafc_tx_cmd(mDefaultSnandCmdInfo.r_cmd, _hal_rtl_snafc_TxCmdAndReadBuffer, col_addr, mDefaultSnandCmdInfo.r_addr_io, mDefaultSnandCmdInfo.r_data_io,
						  byteLens, memAddr);
} /* hal_rtl_snafc_pioPageRead */

SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_pioPageRead(
	void *pAdaptor,
	void *memAddr,
	uint32_t byteLens,
	uint32_t blkPageAddr
)
{
	uint32_t retVal;
	hal_rtl_snafc_pioPageRead(pAdaptor, memAddr, byteLens, blkPageAddr);
#if 1 /* FIXME ToDo: install callback for checking ECC */
	retVal = SUCCESS;
#endif /* FIXME ToDo: install callback */
	return retVal;
} /* hal_rtl_snand_pioPageRead */

/*
 * Trigger SNAND's DMA engine to move data.
 * dir: 0 read (from NAND flash to local memory); 1 write (from local memory to NAND flash)
 */
SECTION_SNAND_TEXT
static void
_hal_rtl_snafc_dmaTrigger(
	uint32_t dma_phy_addr,
	uint32_t dma_io_len,
	uint32_t wr_dir
)
{
	SNAFC_TypeDef *snafc_s = SNAFC_S;

	if (FAIL == _polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt)) {
		DBG_SNAND_ERR("CTLR TO.SR=(0x%08x).DCDSR=(0x%08x)\r\n", snafc_s->SNAFC_SR, snafc_s->SNAFC_DCDSR);
	}

	snafc_s->SNAFC_DRSAR = dma_phy_addr;
	snafc_s->SNAFC_DLR = dma_io_len; /* [29:28](I/O mode,0~2); [16:0](dataLen, n-1) */
	snafc_s->SNAFC_DTR = wr_dir; /* Trigger DMA write or read */ /* [0](DMARWE) 1 for WRITE; 0 for READ. */

	if (FAIL == _polling_snafc_dma_ready(mMaxSnafcDmaRdyCnt)) {
		DBG_SNAND_ERR("DMA TO.SR=(0x%08x).DCDSR=(0x%08x)\r\n", snafc_s->SNAFC_SR, snafc_s->SNAFC_DCDSR);
	}
	return;
} /* _hal_rtl_snafc_dmaTrigger */

/*
 * DMA Write Chunk (Less than 2112-Byte)
 * Start from the assigned cache register address (CA=col_addr)
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_dmaPageWrite(
	void *pAdaptor,
	void *memAddr,
	uint32_t byteLens,
	uint32_t blkPageAddr
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	SNAFC_TypeDef *snafc_s = SNAFC_S;
	uint32_t retVal;
	uint32_t w_data;
	uint32_t w_io_len;
	uint32_t dma_io_len;
	uint32_t virt_to_phy_addr; /*FIXME*/
	uint32_t col_addr = 0;
	uint8_t tPageAddrCycle = 3; /* 3 for 3 bytes pageAddr; 4 (or !=3) for 4 bytes pageAddrs. */
#if 1 /* ROUND_DOWN to ALIGN4 for fitting DMA engine spec. */
	uint8_t tRemainSz = 0; /* Due to SNAFC's DMA SZ MUST ALIGN4, using PIO to access remainSz bytes. (1,2,3) */
#endif

	DBG_SNAND_INFO("hal_rtl_snand_dmaPageWrite++\r\n");
	if (pAdaptor) {
		pSnafcAdaptor = pAdaptor;
		if ((0 != pSnafcAdaptor->snand_cmd_info.w_addr_cycle) && (tPageAddrCycle != pSnafcAdaptor->snand_cmd_info.w_addr_cycle)) {
			tPageAddrCycle = pSnafcAdaptor->snand_cmd_info.w_addr_cycle;
		}
		col_addr = pSnafcAdaptor->col_addr;
		if ((0 != pSnafcAdaptor->snand_cmd_info.w_cmd) && (mDefaultSnandCmdInfo.w_cmd != pSnafcAdaptor->snand_cmd_info.w_cmd)) {
			mDefaultSnandCmdInfo.w_cmd = pSnafcAdaptor->snand_cmd_info.w_cmd;
			mDefaultSnandCmdInfo.w_addr_io = pSnafcAdaptor->snand_cmd_info.w_addr_io;
			mDefaultSnandCmdInfo.w_data_io = pSnafcAdaptor->snand_cmd_info.w_data_io;
		}
	} else {
		tPageAddrCycle = 3;
		col_addr = 0;
	}

	hal_rtl_snand_issueWriteEnableOpCmd(pAdaptor);
	/*++parallel process, saving wait time++*/
	virt_to_phy_addr = (uint32_t) memAddr; /*FIXME*/
	/*--parallel process, saving wait time--*/

	/* Control csLow()/csHigh() for dmaTrigger() */
	_hal_rtl_snafc_csLow();

	/**
	 According to (cmdWidth-addrWidth-dataWidth) configuration, generate waveform on SPI bus.
	 */
	/* Command: SIO, 1-Byte (OP) */
	w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	w_data = (mDefaultSnandCmdInfo.w_cmd << 24); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	if (tPageAddrCycle == 3) {
		/* Address: addr_io_len, 2-Bytes (colAddr) */
		w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.w_addr_io, SNAFC_XCMR_LEN(2));
		w_data = (col_addr << 16); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */

		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

		snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
		snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	} else {
		/* (tPageAddrCycle != 3) */ /* (it should be 4) */
		/* Address: addr_io_len, 3-Bytes (colAddr) */
		w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.w_addr_io, SNAFC_XCMR_LEN(3));
		w_data = (col_addr << 8); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */

		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

		snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
		snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	}

#if 1 /* ROUND_DOWN to ALIGN4 for fitting DMA engine spec. */
	tRemainSz = (byteLens & 0x3);
	byteLens = (byteLens & ~0x3);
#endif

	dma_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.w_data_io, byteLens); /* [29:28](I/O mode,0~2); [16:0](dataLen, N. (NOT N-1). round_down_4) */

	/* Data: data_io_len, byteLens (data payload) */
	_hal_rtl_snafc_dmaTrigger(virt_to_phy_addr, dma_io_len, 1); /* 0 for READ; 1 for WRITE */
#if 1 /* ROUND_DOWN to ALIGN4 for fitting DMA engine spec. */
	if (tRemainSz) {
		uint8_t tmp[4];
		uint8_t *pTmp = NULL;
		pTmp = (uint8_t *)(virt_to_phy_addr + byteLens);
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.w_data_io, SNAFC_XCMR_LEN(tRemainSz));
		/* The last few bytes may be garbage but won't be written to flash, since its length is explicitly given */
		tmp[0] = *((uint8_t *)pTmp++);
		tmp[1] = *((uint8_t *)pTmp++);
		tmp[2] = *((uint8_t *)pTmp++);
		tmp[3] = *((uint8_t *)pTmp++);
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		snafc_s->SNAFC_WDR = *((unsigned int *)tmp); //Trigger PIO Write
	}
#endif

	/* Control csLow()/csHigh() for dmaTrigger() */
	_hal_rtl_snafc_csHigh();

	retVal = hal_rtl_snand_issueProgramExecuteOpCmd(pAdaptor, blkPageAddr);
	hal_rtl_snand_issueWriteDisableOpCmd(pAdaptor);

	DBG_SNAND_INFO("hal_rtl_snand_dmaPageWrite--\r\n");
	return retVal;
} /* hal_rtl_snand_dmaPageWrite */


