swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_snand.c
/*
 * DMA Read One Chunk (2112-Byte)
 * Start from the assigned cache register address (CA=col_addr)
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_dmaPageRead(
	void *pAdaptor,
	void *memAddr,
	uint32_t byteLens,
	uint32_t blkPageAddr
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	SNAFC_TypeDef *snafc_s = SNAFC_S;
	uint32_t w_data;
	uint32_t w_io_len;
	uint32_t dma_io_len;
	uint32_t virt_to_phy_addr; /*FIXME*/
	uint32_t col_addr = 0;
	uint8_t tPageAddrCycle = 3; /* 3 for 3 bytes pageAddr; 4 (or !=3) for 4 bytes pageAddrs. */
#if 1 /* ROUND_DOWN to ALIGN4 for fitting DMA engine spec. */
	uint8_t tRemainSz = 0; /* Due to SNAFC's DMA SZ MUST ALIGN4, using PIO to access remainSz bytes. (1,2,3) */
#endif
	uint32_t retVal;

	DBG_SNAND_INFO("hal_rtl_snand_dmaPageRead(0x%x,0x%x,0x%x,0x%x)++\r\n", memAddr, byteLens, blkPageAddr, col_addr);
	if (pAdaptor) {
		pSnafcAdaptor = pAdaptor;
		if ((0 != pSnafcAdaptor->snand_cmd_info.r_addr_cycle) && (tPageAddrCycle != pSnafcAdaptor->snand_cmd_info.r_addr_cycle)) {
			tPageAddrCycle = pSnafcAdaptor->snand_cmd_info.r_addr_cycle;
		}
		col_addr = pSnafcAdaptor->col_addr;
		if ((0 != pSnafcAdaptor->snand_cmd_info.r_cmd) && (mDefaultSnandCmdInfo.r_cmd != pSnafcAdaptor->snand_cmd_info.r_cmd)) {
			mDefaultSnandCmdInfo.r_cmd = pSnafcAdaptor->snand_cmd_info.r_cmd;
			mDefaultSnandCmdInfo.r_addr_io = pSnafcAdaptor->snand_cmd_info.r_addr_io;
			mDefaultSnandCmdInfo.r_data_io = pSnafcAdaptor->snand_cmd_info.r_data_io;
		}
	} else {
		tPageAddrCycle = 3;
		col_addr = 0;
	}

	hal_rtl_snand_issuePageDataReadToCacheBufOpCmd(blkPageAddr);
	/*++parallel process, saving wait time++*/
	virt_to_phy_addr = (uint32_t) memAddr; /*FIXME*/
	/*--parallel process, saving wait time--*/
	hal_rtl_snand_waitSnandOipComplete(pAdaptor);

	/* Control csLow()/csHigh() for dmaTrigger() */
	_hal_rtl_snafc_csLow();

	/**
	 According to (cmdWidth-addrWidth-dataWidth) configuration, generate waveform on SPI bus.
	 */
	/* Command: SIO, 1-Byte (OP) */
	w_io_len = SNAFC_IO_WIDTH_LEN(SNAFC_SIO_WIDTH, SNAFC_XCMR_LEN(1));
	w_data = (mDefaultSnandCmdInfo.r_cmd << 24); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	if (tPageAddrCycle == 3) {
		/* Address: addr_io_len, 2-Bytes (colAddr) */
		w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.r_addr_io, SNAFC_XCMR_LEN(2));
		w_data = (col_addr << 16); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */

		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

		snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
		snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	} else {
		/* (tPageAddrCycle != 3) */ /* (it should be 4) */
		/* Address: addr_io_len, 3-Bytes (colAddr) */
		w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.r_addr_io, SNAFC_XCMR_LEN(3));
		w_data = (col_addr << 8); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */

		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

		snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
		snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	}

	/* Add 1 byte Dummy cycle, only for READ */
	/* (Dummy) Address: addr_io_len, 1-Bytes */
	w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.r_addr_io, SNAFC_XCMR_LEN(1));
	w_data = (0 << 24); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */

	_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);

	snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
	snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write

	/* Extra 1 byte Dummy cycle, only for "Fast Read Quad I/O" (EBh). i.e. 2 dummy cycle for (r_cmd==0xEB). */
	if (mDefaultSnandCmdInfo.r_cmd == SNAND_FAST_READ_QIO_OP) {
		/* (Dummy) Address: addr_io_len, 1-Bytes (Dummy) */
		w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.r_addr_io, SNAFC_XCMR_LEN(1));
		w_data = (0 << 24); /* SNAFC always fetch from WCMR[3]; then WCMR[2], then WCMR[1], then WCMR[0]. */
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		snafc_s->SNAFC_WCMR = w_io_len; /* [29:28](I/O mode,0~2); [1:0](dataLen, n-1) */
		snafc_s->SNAFC_WDR = w_data; //Trigger PIO Write
	}

#if 1 /* ROUND_DOWN to ALIGN4 for fitting DMA engine spec. */
	tRemainSz = (byteLens & 0x3);
	byteLens = (byteLens & ~0x3);
#endif

	dma_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.r_data_io, byteLens); /* [29:28](I/O mode,0~2); [16:0](dataLen, N. (NOT N-1). round_down_4) */

	/* Data: data_io_len, byteLens (data payload) */
	_hal_rtl_snafc_dmaTrigger(virt_to_phy_addr, dma_io_len, 0); /* 0 for READ; 1 for WRITE */
#if 1 /* ROUND_DOWN to ALIGN4 for fitting DMA engine spec. */
	if (tRemainSz) {
		uint8_t tmp[4];
		uint8_t *pTmp = NULL;
		pTmp = (uint8_t *)(virt_to_phy_addr + byteLens);
		_polling_snafc_ctrlr_ready(mMaxSnafcCtrlRdyCnt);
		w_io_len = SNAFC_IO_WIDTH_LEN(mDefaultSnandCmdInfo.r_data_io, SNAFC_XCMR_LEN(tRemainSz));
		/* Copy remain data (1~3 bytes) from HW FIFO to memory */
		*(unsigned int *)tmp = snafc_s->SNAFC_RDR;
		*(uint8_t *)pTmp = tmp[3];
		pTmp++;
		if (tRemainSz > 1) {
			*(uint8_t *)pTmp = tmp[2];
			pTmp++;
		}
		if (tRemainSz > 2) {
			*(uint8_t *)pTmp = tmp[1];
			pTmp++;
		}
	}
#endif
	/* Control csLow()/csHigh() for dmaTrigger() */
	_hal_rtl_snafc_csHigh();

#if 1 /* FIXME ToDo: install callback for checking ECC */
	retVal = SUCCESS;
#endif /* FIXME ToDo: install callback */

	DBG_SNAND_INFO("hal_rtl_snand_dmaPageRead--\r\n");
	return retVal;
} /* hal_rtl_snand_dmaPageRead */


/*
 * Wrapper API for data write and data read
 */

/*
 * Wrapper API for writing data to S-NAND flash
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_pageWrite(
	void *pAdaptor,
	void *memAddr,
	uint32_t byteLens,
	uint32_t blkPageAddr
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	uint32_t dma_en;
	uint32_t retVal;

	if (pAdaptor) {
		pSnafcAdaptor = pAdaptor;
		dma_en = pSnafcAdaptor->dma_en;
	} else {
		dma_en = 1;
	}

	if (!dma_en) {
		retVal = hal_rtl_snand_pioPageWrite(pAdaptor, memAddr, byteLens, blkPageAddr);
	} else {
		retVal = hal_rtl_snand_dmaPageWrite(pAdaptor, memAddr, byteLens, blkPageAddr);
	}
	DBG_SNAND_INFO("hal_rtl_snand_pageWrite--\r\n");
	return retVal;
} /* hal_rtl_snand_pageWrite */


/*
 * Wrapper API for reading data from S-NAND flash
 */
SECTION_SNAND_TEXT
uint32_t
hal_rtl_snand_pageRead(
	void *pAdaptor,
	void *memAddr,
	uint32_t byteLens,
	uint32_t blkPageAddr
)
{
	hal_snafc_adaptor_t *pSnafcAdaptor = NULL;
	uint32_t dma_en;
	uint32_t retVal;

	if (pAdaptor) {
		pSnafcAdaptor = pAdaptor;
		dma_en = pSnafcAdaptor->dma_en;
	} else {
		dma_en = 1;
	}

	if (!dma_en) {
		retVal = hal_rtl_snand_pioPageRead(pAdaptor, memAddr, byteLens, blkPageAddr);
	} else {
		retVal = hal_rtl_snand_dmaPageRead(pAdaptor, memAddr, byteLens, blkPageAddr);
	}

	DBG_SNAND_INFO("hal_rtl_snand_pageRead--\r\n");
	return retVal;
} /* hal_rtl_snand_pageRead */

/** *@} */ /* End of group hal_rtl_snand_func */

/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

/** *@} */

#endif /* CONFIG_SNAND_FLASH_EN */